<template>
    <div>
        <Header />
        <div class="main">
            <h6>
                1. Регистрация.
            </h6>
            <p>
                Регистрация является неотъемлемой частью присутствия на форуме. Прохождение регистрации автоматически обозначает Ваше согласие с данными Правилами. Если Вы не согласны с данными Правилами, напишите, пожалуйста, 
                <span class="agreeHeader">
                    Администратору
                </span>
                 форума. Он деактивирует Вашу учётную запись.
            </p>
            <p class="warning">
                Обратите внимание, если имя, которое Вы выбрали для участия в форуме:
            </p>
            <p>
                - повторяет уже существующее или нарушает нормы приличия и морали (такие Ники как: Гитлер, Антихрист, содержащие в себе религиозные термины и т. д.);
            </p>
            <p>
                - ассоциируется с современными политическими деятелями, партиями, геополитической ситуацией и т.п.;
            </p>
            <p>
                - несёт в себе рекламу сайтов;
            </p>
            <p>
                - содержит ненормативную лексику;
            </p>
            <p>
                - сходно до степени смешения с модераторским или админским, или названием одной из групп форума
            </p>
            <p class="warning">
                то Ваша учётная запись будет деактивирована без предупреждения.
            </p>
            <p>
                Кроме того, не выбирайте себе аватары, содержащие нецензурные изображения, имитирующие ранги на форуме или копирующие аватары 
                <span class="agreeHeader">
                    Администраторов
                </span>
                 или
                <span class="agreeHeader">
                    Модераторов
                </span>
                .
            </p>
            <p>
                Пользователь обязуется не передавать другим лицам свои персональные данные, полученные при регистрации (логин и пароль, пасскей) для входа/идентификации на ресурс.
            </p>
            <p>
                Пользователь несет полную ответственность за утерю, пропажу, исчезновение или передачу иными способами персональных данных, а также за последствия связанные с данным деянием.
            </p>
            <h6>
                2. Ограничения на форуме.
            </h6>
            <p>
                Всем участникам данного форума
                <span class="notallowed">
                    запрещается:
                </span>
            </p>
            <p>
                <span class="notallowed">
                    2.1.
                </span>    
                Оскорблять участников форума в любой форме. Запрещено проявление любой грубости, угроз, личных оскорблений и нецензурных высказываний, в том числе и в скрытой форме, как в отношении юридических, так и конкретных физических лиц. Участники должны соблюдать уважительную форму общения.
            </p>
            <p>
                <span class="notallowed">
                    2.2.
                </span>    
                Пользоваться в общении на форуме матерными выражениями и словами, в том числе и в завуалированной форме.
            </p>
            <p>
                <span class="notallowed">
                    2.3.
                </span>    
                Заниматься оверпостингом и размножением офф-топиков.
            </p>
            <p>
                <span class="notallowed">
                    2.4.
                </span>    
                Создавать темы с названиями, не объясняющим вкратце ее сути: "помогите", "проблема" и им подобными.
            </p>
            <p>
                <span class="notallowed">
                    2.5.
                </span>    
                Публиковать кряки, серийные номера и т. п. в открытом виде.
            </p>
            <p>
                <span class="notallowed">
                    2.6.
                </span>    
                Писать рекламные тексты и сообщения коммерческого характера.
            </p>
            <p>
                <span class="notallowed">
                    2.7.
                </span>    
                Заниматься коммерцией и сбором пожертвований при помощи ресурса. В том числе запрещена публикация электронных кошельков как в сообщениях на форуме или в личных, так и в подписи, на аватаре и в профиле в целом.
            </p>
            <p>
                <span class="notallowed">
                    2.8.
                </span>    
                 Использовать форум как почтовую доску объявлений для сообщений приватного характера, адресованных конкретному участнику (для этого есть почта).
            </p>
            <p>
                <span class="notallowed">
                    2.9.
                </span>    
                Проявлять нетолерантность, расовую, национальную, политическую и религиозную неприязнь, пропагандировать терроризм, экстремизм, наркотики и прочие темы, несовместимые с общепринятыми законами морали и приличия.
            </p>
            <p>
                <span class="notallowed">
                    2.10.
                </span>    
                Публикация как прямых, так и скрытых ссылок на другие ресурсы сети, особенно если существует раздача на данном форуме (исключениями могут являться ссылки на описание программы/фильма, а также сэмплы и скриншоты).
            </p>
            <p>
                <span class="notallowed">
                    2.11.
                </span>    
                Использовать в общении на форуме язык, отличный от русского - в форум встроены виртуальная русская клавиатура и транслит. Английский язык допустим для благодарностей и прочих малозначимых сообщений. В большем объеме его использование допускается в тех разделах, где размещается иноязычный контент (музыка, софт, книги и т. п.). Язык общения с модераторами - русский (если нет иных обоюдных договоренностей).
            </p>
            <p>
                Также запрещено злоупотребление тегами, смайликами, картинками, нестандартными шрифтами, их цветом и т. п., как при оформлении раздач, так и в сообщениях.
            </p>
            <p>
                <span class="agreeHeader">
                    Модераторы
                </span>
                 и 
                <span class="agreeHeader">
                    Администраторы
                </span>
                 имеют право редактировать или удалять сообщения, написанные с нарушением этого правила, без предупреждения.
            </p>
            <p>
                <span class="notallowed">
                    2.12.
                </span>    
                Публично предъявлять претензии и обсуждать действия Модератора или Администратора. Участник форума, несогласный с действиями Модератора, может высказать своё несогласие Модератору по почте или в личном сообщении. Если от Модератора нет ответа или ответ, по мнению участника, необоснованный, последний вправе переписку с Модератором отправить Администратору. Конечное решение принимает Администратор. Это решение является окончательным и необсуждаемым.
            </p>
            <p>
                <span class="notallowed">
                    2.13.
                </span>    
                Со стажем менее 2-х недель вступать в Релиз-группы.
            </p>
            <p>
                <span class="notallowed">
                    2.14.
                </span>    
                Редактировать/удалять комментарии Модератора или Администратора.
            </p>
            <h6>
                3. Ограничения на трекере.
            </h6>
            <p>
                Все создающие раздачу (выкладывающие файл для общедоступного скачивания) обязаны контролировать содержимое этой раздачи по качеству (к примеру, отсутствие звука в фильмах, неснятая защита в программах, неработоспособность программы и т. п.).
            </p>
            <p>
                Всем участникам раздач на данном трекере
                <span class="notallowed">
                    запрещается
                </span>
            </p>
            <p>
                <span class="notallowed">
                    3.1.
                </span>    
                Создавать и размещать для скачивания раздачу, дублирующую то, что уже существует на rutracker.org. Дублирующей считается не отличающаяся ни по содержанию, ни по качеству информация.
            </p>
            <p>
                <span class="notallowed">
                    3.2.
                </span>    
                 Размещать для скачивания видео без русскоязычного перевода. Запрет не распространяется на спортивные передачи и трансляции, материалы для обучения иностранным языкам, музыкальное видео, видеоуроки и обучающее видео, не требующие перевода документальные фильмы и развлекательные передачи. Окончательное решение о раздаче без перевода принимает модератор раздела.
            </p>
            <p>
                <span class="notallowed">
                    3.3.
                </span>    
                 Создавать и размещать для скачивания раздачу, содержащую документальные съёмки сцен и предметов, нарушающих общественные нормы морали, различные Базы Данных и иные материалы, отсутствующие в свободном законном доступе и т. п
            </p>
            <p>
                <span class="notallowed">
                    3.4.
                </span>    
                 Вкладывать в содержимое торрента прямые ярлыки/рекламу сторонних ресурсов.
            </p>
            <p>
                <span class="notallowed">
                    3.5.
                </span>    
                Закрывать канал на отдачу. Следует поддерживать отношение объема отданной информации к объему скачанной больше, чем 0,3. После окончания скачивания оставайтесь на раздаче до появления 3-4-х следующих закачавших. Также запрещается техническими, программными или иными средствами и методами препятствовать файлообмену и искажать статистику обмена данными между пользователями ресурса (читерство). Запрещается обсуждение подобных методов. В случае нарушений Ваша учётная запись может быть деактивирована без предупреждения.
            </p>
            <p>
                <span class="notallowed">
                    3.6.
                </span>    
                Использовать для закачки торрента любые менеджеры закачек.
            </p>
            <p>
                <span class="notallowed">
                    3.7.
                </span>    
                Самовольно перезаливать торрент-файл в закрытой Модератором раздаче без устранения причин, по которым раздача была закрыта. А также, в интересах пользователей трекера, авторам запрещается удалять оформление и торренты проверенных релизов.
            </p>
            <p class="notallowed">
                Решение по соответствию раздачи данным требованиям принимает 
                <span class="agreeHeader">
                    Модератор
                </span>
                 и/или 
                 <span class="agreeHeader">
                    Администратор
                </span>
                    . В их полномочиях редактировать, перемещать, закрывать или удалять раздачу.
            </p>
            <h6>
                4. Модераторы и Администраторы.
            </h6>
            <p>
                - 
                <span class="agreeHeader">
                    Модераторы
                </span>
                 выбираются из числа наиболее активных и грамотных пользователей ресурса.
            </p>
            <p>
                - 
                <span class="agreeHeader">
                    Модератор
                </span>
                 может быть переведен в категорию VIP при отсутствии активной модераторской деятельности в течение двух месяцев и более.
            </p>
            <p>
                - 
                <span class="agreeHeader">
                    Модераторы
                </span>
                 следят за соблюдением Правил форума.
            </p>
            <p>
                - 
                <span class="agreeHeader">
                    Модератор
                </span>
                 может отредактировать или удалить сообщение пользователя, если сочтет необходимым.
            </p>
            <p>
                - 
                <span class="agreeHeader">
                    Модератор
                </span>
                 может закрыть тему, если тема потеряла актуальность, если участники отклонились от ее сути или по другим причинам.
            </p>
            <p>
                - 
                <span class="agreeHeader">
                    Модератор
                </span>
                 может переместить тему в наиболее подходящую категорию.
            </p>
            <p>
                Указанные действия могут быть осуществлены и 
                <span class="agreeHeader">
                    Администратором.
                </span>
            </p>
            <p>
                - 
                <span class="agreeHeader">
                    Техническая помощь
                </span>
                 - группа с частичными модераторскими правами; предназначена для осуществления технической помощи посетителям ресурса.
            </p>
            <hr />
            <h4>
                5. Аватара и подпись участников форума также должны соответствовать следующим пунктам:
            </h4>
            <h6>
                5.1 Подпись:
            </h6>
            <p>
                - Максимальная высота: 80 точек (другими словами, не больше четырех юзербаров или восьми строк текста (размер шрифта 10); ширина: 750 точек.
            </p>
            <p>
                - Общий вес изображений, содержащихся в подписи, не должен превышать 150 Kb.
            </p>
            <p>
                - Содержание: недопустимы насилие, угрозы (на демографической, национальной, религиозной или политической основе), сквернословия (ненормативная лексика, обзывательства, грубость и т. д.), разврат (порнография), дискриминация в любых проявлениях, тексты и изображения рекламного или коммерческого характера, имитация званий/рангов этого ресурса, тексты и изображения, отражающие современную политическую и экономическую ситуацию (лозунги, агитация, фотографии политических деятелей и т. д.), а также изображения провокационного толка, в т. ч. с использованием нацистской символики.
            </p>
            <p>
                - Анимация: сильно мигающие подписи запрещены (степень мигания определяется администрацией).
            </p>
            <p>
                - Подпись под Вашими сообщениями не может быть использована для создания ссылок на какие-либо ресурсы сети.
            </p>
            <h6>
                5.2 Aватара:
            </h6>
            <p>
                - Максимальный размер: 100х100 точек; вес: до 30 Кб.
            </p>
            <p>
                - Содержание: недопустимы насилие, угрозы (на демографической, национальной, религиозной или политической основе), сквернословия (ненормативная лексика, обзывательства, грубость и т. д.), разврат (порнография), дискриминация в любых проявлениях, пропаганда наркотиков, коммерческая реклама и рекламные тексты, имитация званий/рангов этого ресурса, намеренная схожесть с аватарами членов администрации, изображения, отражающие современную политическую ситуацию (фотографии политических деятелей и т. п.), а также изображения провокационного толка, в т. ч. с использованием нацистской символики.
            </p>
            <p>
                - Анимация: сильно мигающие аватары запрещены (степень мигания определяется администрацией).
            </p>
            <p>
                Если Вы нарушите Правила, касающиеся подписи или аватары, то Вам может быть запрещён их показ без предупреждения.
            </p>
            <div class="agreeBtnContainer">
                <button @click="$router.push({ name: 'Register' })" class="btn btn-light agreeBtn">
                    Я согласен с этими правилами
                </button>
            </div>
        </div>
        <Footer />
    </div>
</template>

<script>
import Header from '@/components/Header.vue'
import Footer from '@/components/Footer.vue'

export default {
    name: 'Agreement',
    components: {
        Header,
        Footer
    }
}
</script>

<style scoped>
    
    .agreeBtn {
        font-weight: bolder;
        border: 1px solid rgb(150, 150, 150);
        width: 275px;
        align-self: center;
    }

    .agreeBtnContainer {
        display: flex;
        justify-content: center;
    }

    .agreeHeader {
        font-weight: bolder;
        cursor: pointer;
        color: rgb(50, 50, 255);
    }

    .notallowed {
        color: rgb(215, 0, 0);
    }

    .warning {
        font-weight: bolder;
    }

    .main {
        margin: auto;
        width: 98%;
        display: flex;
        flex-direction: column;
        background-color: rgb(245, 245, 245);
        box-sizing: border-box;
        padding: 15px;
    }

</style>